meeting/minutes/2022/12-06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 014 Minutes 2022-12-06</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 014 Minutes 2022-12-06</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/4]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/13]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#next-meeting">1.3. Next meeting</a></li>
<li><a href="#approve-minutes">1.4. Approve minutes of the previous meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[3/4]</code></a></li>
<li><a href="#upcoming-meetings">1.6. Schedule for upcoming meetings</a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#iss-278">2.1. Issue 278, array bounds checking</a></li>
<li><a href="#pr-fn-foot">2.2. Review pull request #250: fn:foot, etc.</a></li>
<li><a href="#iss-274">2.3. Issue 274, building a module repository for QT</a></li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
<li><a href="#h-C42F89DC-52DF-40F2-B5BA-288B982BE9DA">4. Adjourned</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/4]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-014-01: MK to propose new <code>try-get</code> functions for arrays, maps, and (maybe) sequences</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-014-02: MK to draft a spec for <code>array:exists()</code> and <code>array:empty()</code> functions</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-014-03: MK to update PR #250 with the new names</li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/13]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Anthony (Tony) Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="off"><code>[&#xa0;]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="off"><code>[&#xa0;]</code> Adam Retter</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="on"><code>[X]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="off"><code>[&#xa0;]</code> Norm Tovey-Walsh (NW). <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2022/12-06.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2022/12-13.html">is scheduled for Tuesday, 13 December</a>.
</p>

<p>
Possible regrets from MK; he will try to make it.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/11-29.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[3/4]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="on"><code>[X]</code> QT4CG-013-01: MK to refine the coercion rules with respect to enumeration types
<ul class="org-ul">
<li><a href="https://github.com/qt4cg/qtspecs/issues/283">https://github.com/qt4cg/qtspecs/issues/283</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-013-02: DN to provide a concrete example of the function case discussed with respect to coercion rules.
<ul class="org-ul">
<li><a href="https://github.com/qt4cg/qtspecs/issues/281#issuecomment-1336491005">https://github.com/qt4cg/qtspecs/issues/281#issuecomment-1336491005</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-013-03: MK to raise a separate issue about sequence/array out-of-bounds handling
<ul class="org-ul">
<li><a href="https://github.com/qt4cg/qtspecs/issues/278">https://github.com/qt4cg/qtspecs/issues/278</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-upcoming-meetings" class="outline-3">
<h3 id="upcoming-meetings"><span class="section-number-3">1.6.</span> Schedule for upcoming meetings</h3>
<div class="outline-text-3" id="text-upcoming-meetings">
<p>
The next few meetings scheduled after this one are:
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 13 December 2022</li>
<li class="on"><code>[X]</code> 20 December 2022</li>
<li class="off"><code>[&#xa0;]</code> <del>27 December 2022</del></li>
<li class="off"><code>[&#xa0;]</code> <del>3 January 2023</del></li>
</ul>

<p>
Meetings on 27 December and 3 January are canceled.
</p>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-iss-278" class="outline-3">
<h3 id="iss-278"><span class="section-number-3">2.1.</span> Issue 278, array bounds checking</h3>
<div class="outline-text-3" id="text-iss-278">
<p>
Placed before PR #250 because I think it’s relevant to closing that issue.
</p>

<ul class="org-ul">
<li>MK: I was given an action last week to write up what we should do: see <a href="https://github.com/qt4cg/qtspecs/issues/278">#278</a>.
<ul class="org-ul">
<li>… The primary problem is the asymmetry of array and sequence bounds checking</li>
<li>… We discussed how we might address this asymmetry</li>
<li>… The most promising is to use the static context</li>
</ul></li>
</ul>

<p>
Mike walks us through the prose of the issue.
</p>

<ul class="org-ul">
<li>MK: I think “do nothing” is the default if we can’t find a good solution.
<ul class="org-ul">
<li>… Adding an option to the static context has the advantage that it
applies to both functions and operators.</li>
<li>… Reviews a sketch of the consequences for both arrays and sequences</li>
<li>… DN points out that <code>array:get</code> would then have the same ambiguity as <code>map:get</code>.
<ul class="org-ul">
<li>… Could be addressed with an <code>array:contains</code> function or by manually checking.</li>
</ul></li>
<li>… DN proposes returning a magic value, but MK is ill disposed to the idea.</li>
</ul></li>
</ul>

<p>
The question is, do we want to pursue this?
</p>

<ul class="org-ul">
<li>DN: Thank you. But there were some later thing that you didn’t
mention. I want to express the opinion that I’m absolutely opposed
to allowing array functions to return ambiguous results.
<ul class="org-ul">
<li>… The best constructive example I could find is the try/get value
in dictionaries in C# and several other data types.</li>
<li>… The solution is simple. Just return a composite result: did the
request succeed, and what was the value.</li>
<li>… This has been tried in the .NET world for at least a decade and
programmers are happy with it (no issues).</li>
<li>… We should do this when we want to resolve the ambiguitty with
arrays.</li>
</ul></li>

<li>NW: Question of clarification…</li>
<li>DN: It would be a new function <code>array:try-get()</code>.</li>
<li>MK: A composite function would also be useful for maps.</li>
<li>BTW: Couldn’t it always be a tuple? Why does it have to be different?</li>
<li>RD: We can’t really retrofit for existing functions.</li>
<li>MK: Yes, this would be for a new function and independent of the
static context option.</li>
<li>MSM: If we introduce <code>try-get</code> with a composite result, then does
that mean we can just leave out the static context option? What does
<code>array:get</code> do if bounds checking is turned off.</li>
<li>DN: I think <code>array:get</code> will continue to raise an error.</li>
</ul>

<p>
Some discussion of how these new functions and the static context option.
</p>

<ul class="org-ul">
<li>RD: There are examples using sequences where you can have an
expression that returns 0 where you don’t have an item. If we made
that throw an exception, then you could cause failures when the
static context checking is enabled. Because that code won’t have
try/catch around it, it won’t behave as you’d expect it to.</li>
<li>MK: If we had a function <code>try-get</code> for arrays, maps, and sequences,
and perhaps a few other cases (like head), would that be an adequate
solution to this problem?</li>
<li>NW: I was going to ask the same thing, it sure sounds that way to me.</li>
<li>MSM: It has the advantage that it’s the same programmer accessible
action in each case.</li>
<li>NW: I think not changing the static context is a win.</li>
<li>JL: The try-get will give you back a tuple that you have to bind
into a variable in order to check the value.</li>
<li>DN: There is the possibility to have a new feature here were you can
assign to mulitple variables.</li>
<li>RD: I have a proposal to do that, <a href="https://github.com/qt4cg/qtspecs/issues/37">#37</a>.</li>
</ul>

<p>
Proposal: add try-get for arrays and maps and call it done?
</p>

<ul class="org-ul">
<li>JL: Would we add <code>array:contains</code>?</li>
<li>MK: I worry the name would be missleading.</li>
<li>MSM: I don’t see how try-get for arrays and maps handles the absence
of bounds checking for sequences.
<ul class="org-ul">
<li>… I’m still not completely sold on this at all.</li>
<li>… It strikes me as close to the point of a much smaller group,
much later revisiting the basic design choices of a previous
larger group.</li>
</ul></li>
</ul>

<p>
Proposal: add try-get for sequences, arrays, maps and call it done?
</p>

<ul class="org-ul">
<li>DN: In this proposal, we’re missing a way to say that an
unsuccessful search operation on a sequnce should throw an error.
<ul class="org-ul">
<li>… That would give us parity between sequences and arrays.</li>
</ul></li>
<li>BTW: I like the point DN made about having absolute symmetry between
arrays and sequences is perhaps only necessary if we’re implying
arrays and sequences are the same kinds of things, which they
aren’t. They are different, so doesn’t it make sense that they
should behave differently?</li>
<li>DN: I competely agree, the only use case I’ve found for introducing
errors when unsuccessfully searching a sequence is because it will
surprise Haskell programmers. Perhaps we can ignore it.</li>
<li>MK: There’s always the trivial example of people writing <code>$x[0]</code> and
wondering why that doesn’t raise an error since it’s nonsense.</li>
<li>RD: I think <code>try-get</code> functions for arrays and maps could be quite
useful. If that solves the original problem that DN raised, then I
think that should resolve it.</li>
</ul>

<p>
ACTION: QT4CG-014-01: MK to propose new <code>try-get</code> functions for arrays, maps, and (maybe) sequences
</p>
</div>
</div>

<div id="outline-container-pr-fn-foot" class="outline-3">
<h3 id="pr-fn-foot"><span class="section-number-3">2.2.</span> Review pull request #250: fn:foot, etc.</h3>
<div class="outline-text-3" id="text-pr-fn-foot">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-250">pull request #250</a> and the <a href="https://qt4cg.org/meeting/minutes/2022/11-29.html#pr-fn-foot">minutes of meeting 013</a>.
</p>

<ul class="org-ul">
<li>DN: I think <code>fn:final()</code> and <code>fn:prefix()</code> are much better than
<code>fn:foot()</code> or <code>fn:truncate()</code></li>
<li>NW: Is naming the only problem?</li>
<li>MK: I think there’s also the problem of <code>array:head()</code> on an empty
sequence.</li>
<li>DN: I’d be happy to use try-get</li>
<li>MSM: Then I suggest what we do is put that as a question.</li>
<li>DN: The question of having <code>array:head</code> can also be resolved by
<code>array:exists()</code> and <code>array:empty()</code>.</li>
<li>MK: That’s a bit similar to the duality of <code>map:contains()</code> and <code>map:get()</code>.</li>
</ul>

<p>
Some discussion about the names. They aren’t the best names, but that
ship has sailed.
</p>

<p>
Proposal: Add <code>array:exists()</code> and <code>array:empty()</code> functions?
</p>

<p>
Accepted.
</p>

<p>
ACTION: QT4CG-014-02: MK to draft a spec for <code>array:exists()</code> and <code>array:empty()</code> functions
</p>

<p>
Proposal: With <code>try-get</code> functions and the new array functions, we have sufficient tools to deal with array bounds checking in head
</p>

<p>
Accepted.
</p>

<ul class="org-ul">
<li>NW: So we’re down to just the names. What’s the right answer?</li>
<li>MK: The problem with prefix is that it’s strongly associated with QNames</li>
</ul>

<p>
General agreement that <code>fn:foot()</code> is ok, but <code>fn:truncate()</code> isn’t great.
</p>

<ul class="org-ul">
<li>BTW: I propose <code>fn:trunk()</code>. It’s a noun and has lots of good
connotations.</li>
</ul>

<p>
Proposal: Accept #250 using the names <code>fn:foot</code> and <code>fn:trunk</code>
</p>

<p>
Accepted.
</p>

<p>
ACTION: QT4CG-014-03: MK to update PR #250 with the new names
</p>

<ul class="org-ul">
<li>DN: I suggest we make BTW our linguistic ambassador.</li>
</ul>
</div>
</div>

<div id="outline-container-iss-274" class="outline-3">
<h3 id="iss-274"><span class="section-number-3">2.3.</span> Issue 274, building a module repository for QT</h3>
<div class="outline-text-3" id="text-iss-274">
<p>
There’s been some discussion of this issue in the comments. I think it
might benefit from some face-to-face discussion. I propose to time-box
this discussion to say 20 or 30 minutes.
</p>

<ul class="org-ul">
<li><p>
NW: Suppose I want to use a package for Node or Perl or Python or
TeX or C# or…
</p>
<ol class="org-ol">
<li>I run the package manage to download the code</li>
<li>I stick some simple import statement at the top of my code</li>
<li>I use it.</li>
</ol>
<p>
I think we’d be helping the QT community if we made that possible.
Solutions like the one DN outlined in the issue are clever, but I don’t
think they’re really sufficient. They’re beyond the reach of ordinary mortals.
But maybe I’m wrong.
I don’t think it’s a lot of work, but is it worth doing?
</p></li>

<li>DN: I disagree that my proposal is beyond ordinary mortals.</li>

<li>RD: I think it has a couple of issues; how do you locate the
packages so they can be searched etc. How do you make it so that you
can work offline. How do you fit it in with existing mechanisms and
existing vendors? How does it work for existing vendors? And how do
you make it so you can have a single package that can support all of
those.</li>

<li>DN: I’m using environment variables to specify a list of URLs in
which to look for module. Speaking about expressing the functions as
leaf nodes of a tree of a map doesn’t mean that they have to be
presented that way to the end user. That could be addressed by
having “the loader” generate functions in a particular namespace.
This also answers one tricky question which is how to use the
namespaces. If we want to achieve something similar to the
hiearchical namespaces of many programming languages, then using a
tree could naturally lead to the namespace URL and to a tree of
namespaces. This could lead to natural levels of abstraction. I’m
not sure if designing tools for the languages is part of our subject
area. We don’t have a formal remit to do this.</li>

<li>MK: To make this work, there are three ingredients that need to be
in place: 1. language syntax; that’s why use-package and so on in
XSLT were designed. 2. defining a service and protocols; the
specification of machinery for how a repository would interface with
the world. 3. engineering and operation of a repository; we’re not
that kind of group and I’m not sure how that would work.</li>

<li>BTW: Building on what MK said, is this then something for which a
separate group is needed. Someone with an explicit remit to do the
engineering for this?</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>

<div id="outline-container-h-C42F89DC-52DF-40F2-B5BA-288B982BE9DA" class="outline-2">
<h2 id="h-C42F89DC-52DF-40F2-B5BA-288B982BE9DA"><span class="section-number-2">4.</span> Adjourned</h2>
<div class="outline-text-2" id="text-h-C42F89DC-52DF-40F2-B5BA-288B982BE9DA">
</div>
</div>
</div>
</body>
</html>
